{"elements": [{"name": "header", "degree": 2, "text": "Overview"}, {"name": "paragraph", "text": "Null Text Editor is a custom built text editor made completely from scratch. The idea was a simple text editor that had a command line style interface, without actually using the command line. My plan was for this to fully replace \"notepad.exe\" on my personal computer. Originally only supposed to be taking around a month to code, the project quickly grew and ended up taking much longer. This project ended up teaching me a lot about the software developement cycle before I even knew what that was."}, {"name": "media", "text": "Icon for Null", "link": "/projects/images/null-screenshot.png"}, {"name": "header", "degree": 2, "text": "Technology & Programming"}, {"name": "paragraph", "text": "Null was written entirly in C++. What I wanted to do was recreate a console style interface from scratch and I did that using OpenGL. It uses simple graphics techniques to display textures to the screen for each letter, displaying text. All text controls and keyboard commands were added from scratch."}, {"name": "header", "degree": 2, "text": "What I Learned"}, {"name": "paragraph", "text": "This project taught me a whole lot about software developement, and I learned a lot of skills during the lifetime of the project. First of all was C++ and OpenGL. Having no experience with either, I had to learn the basics of both, from scratch to create this project. While learning the essentials of OpenGL, I discovered a passion for graphics programming and developed a keen interest in both OpenGL and low-level graphics programming. I also developed botha hatred and love for C++."}, {"name": "paragraph", "text": "As mentioned before, this project was my introduction to the software developement cycle. This was the biggest project I had attempted up to that point and starting was quite confusing because I had no idea what to do. It made me realize how important the steps before coding were, and that sometimes you can't just jump straight to code if you want to succeed."}, {"name": "header", "degree": 2, "text": "Features"}, {"name": "paragraph", "text": "Null text Editor has many features, which is part of why it took so long to finish. These include:"}, {"name": "list", "ordered": false, "items": ["An asthetic simple UI and user experience", "A virtual \"notebook\" with its own folder and files structure", "Opening any files on your pc", "Many settings, including the ability to change the colour theme", "Many keyboard shortcuts"]}, {"name": "header", "degree": 3, "text": "Future Additions"}, {"name": "paragraph", "text": "I had very big plans for this project when I first started. These include many features that never got to be included due to time constaints. I will try to add them one day, but here is a list:"}, {"name": "list", "ordered": false, "items": ["Encryption to files", "More appearance settings (such as bloom)", "More customization to the appearance", "integration with git", "Some easter eggs"]}]}